src/cf/InformationRegisters/бпсНастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<InformationRegister>
		<Properties>
			<Name>бпсНастройкиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НеУведомлятьОЗадачахПочтой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИДПользователяТелеграмм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/бпсНастройкиПользователей/Ext/ManagerModule.bsl
Функция ПолучитьНастройкиПользователя(Пользователь) Экспорт 
	пНастройкиПользователя = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бпсНастройкиПользователей.Пользователь,
	|	бпсНастройкиПользователей.НеУведомлятьОЗадачахПочтой,
	|	бпсНастройкиПользователей.АдресЭлектроннойПочты,
	|	бпсНастройкиПользователей.ИДПользователяТелеграмм
	|ИЗ
	|	РегистрСведений.бпсНастройкиПользователей КАК бпсНастройкиПользователей
	|ГДЕ
	|	бпсНастройкиПользователей.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		пНастройкиПользователя = Новый Структура();
		пНастройкиПользователя.Вставить("Пользователь",Пользователь);
		
		Выборка = РезультатЗапроса.Выбрать();		
		Пока Выборка.Следующий() Цикл
			пНастройкиПользователя.Вставить("НеУведомлятьОЗадачахПочтой",Выборка.НеУведомлятьОЗадачахПочтой);
			пНастройкиПользователя.Вставить("АдресЭлектроннойПочты",Выборка.АдресЭлектроннойПочты);					
			пНастройкиПользователя.Вставить("ИДПользователяТелеграмм",Выборка.ИДПользователяТелеграмм);					
		КонецЦикла;
	КонецЕсли;
	Возврат пНастройкиПользователя;
КонецФункции //ПолучитьНастройкиПользователя(Пользователь)
